CaseFolder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application chtMultiRegionFoam;

startFrom 	latestTime;

startTime 	0;

stopAt 		endTime;

endTime 	1000;

deltaT 		0.1;

writeControl 	adjustableRunTime;

writeInterval 	1000;

purgeWrite 	0;

writeFormat 	ascii;

writePrecision 	6;

writeCompression off;

timeFormat 	general;

timePrecision 	6;

runTimeModifiable true;

// ************************************************************************* //
