CaseFolder/0/metal/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/metal";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 320;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(inlet|outlet|exterior)"
    {
        type            zeroGradient;
    }
    metal_to_fluid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     solidThermo;
    }
    heater
    {
		type            fixedGradient;
		gradient        uniform 2.04E3; // steel foil at 7A 2.04E3
    }
    "(xmin|xmax)"
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
