CaseFolder/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


xfluid	50E-6;
xmax	150E-6;
yheater 100E-6;
yfluid	200E-6;
ywall	700E-6;
ymax	800E-6;
zmax	1000E-6;

actions
(
	//Fluid
    {
        name    fluidCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0 $yfluid 0)($xfluid $ywall $zmax);
        }
    }
    {
        name    fluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set fluidCellSet;
        }
    }
	
	//Heater
    {
        name   	heaterCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0 0 0)($xmax $yheater $zmax);
        }    
    }
    {
        name    heater;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set heaterCellSet;
        }
    }

	//Metal
    {
        name    metalCellSet;
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set fluidCellSet;
        }
    }

    {
        name    metalCellSet;
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set heaterCellSet;
        }
    }

    {
        name    metalCellSet;
        type    cellSet;
        action  invert;
    }

    {
        name    metal;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set metalCellSet;
        }
    }


);


// ************************************************************************* //
